import '../controller/imports.dart';

class TermsAndConditions extends StatelessWidget {
  const TermsAndConditions({super.key});

  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: const GlobalAppBar(title: "Terms and Condidtions"),
      body: SingleChildScrollView(
        physics: const BouncingScrollPhysics(),
        child: Padding(
          padding: const EdgeInsets.symmetric(horizontal: 15.0, vertical: 12),
          child: Column(
            crossAxisAlignment: CrossAxisAlignment.start,
            children: const [
              Text(
                "باستخدامك التطبيق فإنك تُقر بتحمل كامل المسئولية، وتلتزم بضوابط وشروط التطبيق وهي كالتالي:",
                style: TextStyle(
                    fontSize: 18,
                    color: mainColor,
                    fontWeight: FontWeight.w600),
              ),
              SizedBox(height: 10),
              Text(
                " •	التطبيق غير مسؤول عن أي أضرار بين المُؤجر والمُستأجر على سبيل المثال وليس الحصر: الإتلاف والسرقة. كذلك أن التطبيق غير مسؤول عن أي خسائر او مُخاطرة او تبِعات تنشأ بين المُؤجر والمُستأجر او أي طرف اخر أو التي تنتج عن عملية الوساطة التي يقوم بها هذا التطبيق. وفي حال حصول الضرر يجب تقديم بلاغ رسمي للجهات المختصة.\n •	التطبيق غير مسؤول عن أي لقاءات أو محادثات تحصل بين الأطراف المستخدمة للتطبيق خارج أو داخل التطبيق.\n •	عدم الحاق الضرر بالمستخدمين باي شكل كان.\n •	في حال انخفاض تقييمك أو في حال ازدياد الشكاوى السلبية بحقك فإنه يحق للتطبيق التصرف بما يراه مناسباً.\n •	إقرارك باتباعك لجميع القوانين واللوائح والأنظمة ذات الصلة أثناء استخدام التطبيق.\n •	إقرارك بأحقية التطبيق في مراقبة الرسائل الخاصة عند الضرورة لخلوها من مخالفات اتفاقية الاستخدام.\n •	إقرارك بمنح الحق للتطبيق بحفظ بياناتك ومعلوماتك ولنا حق الاطلاع عليها.\n •	تقر موافقتك على إظهار بياناتك (الاسم- رقم الجوال) للمستخدمين الآخرين.\n •	تقر موافقتك بأحقية التطبيق في مشاركة المعلومات في حالة السرقة الاتلاف.\n •	في حال مخالفتك للأنظمة في المملكة العربية السعودية او قوانين التطبيق، لنا حق الرجوع إليك بكافة الأضرار والخسائر وتحميلك أتعاب المحاماة في جميع القضايا والمسائل المتعلقة بمخالفتك وتلتزم بالتعويض عنها.\n •	عدم عرض أي غرض غير ملائم للتصنيفات المتاحة في التطبيق وغير مسموح بتداوله في المملكة العربية السعودية.\n •	عدم اختراق التطبيق او التحايل على سياساته.\n •	عدم استخدام أي وسيلة غير شرعية للوصول لبيانات المستخدمين او انتهاك حقوق التطبيق.\n •	عدم انتهاك حقوق الملكية الفكرية للتطبيق.\n •	عدم جمع او استعمال البيانات الشخصية للمستخدمين واتصالاته لأغراض غير مصرح بها او الإفصاح عنها لاي جهة الا بموافقة من تتعلق به البيانات الشخصية او إذا اقتضت الأنظمة ذلك.\n •	عدم الإقدام على أي ما من شأنه الحاق الضرر بسمعة التطبيق سواء في التطبيق نفسه او في مواقع التواصل الاجتماعي ويحتفظ التطبيق بحقه في الرجوع عليك بكافة الأضرار المترتبة على ذلك.\n •	عدم انتحال صفة، أو ممثل، أو موظف، أو أي صفة توحي بانك تابع للتطبيق.\n •	عدم ايجار او استئجار كل من:\n   1.	السلع الممنوعة حسب قوانين المملكة العربية السعودية.\n   2.	الأسلحة بجميع أنواعها، حتى لو مرخصة.\n   3.	المنتجات الجنسية بجميع أشكالها.\n   4.	الأدوية والمنتجات الصحية ولو كانت مرخصة.",
                textAlign: TextAlign.justify,
                style: TextStyle(
                  height: 1.75,
                  fontSize: 16,
                ),
              ),
              SizedBox(height: 15),
              Text(
                "عدم التزامك بتلك الشروط يمنح التطبيق الحق بإلغاء حسابك واتخاذ الإجراءات النظامية اللازمة.",
                style: TextStyle(
                    fontSize: 18, fontWeight: FontWeight.w500, color: secColor),
              )
              // SizedBox(height: 8),
              // Text(
              //   " •	التطبيق غير مسؤول عن أي لقاءات أو محادثات تحصل بين الأطراف المستخدمة للتطبيق خارج أو داخل التطبيق.",
              //   style: TextStyle(fontSize: 16),
              // ),
              // SizedBox(height: 8),
              // Text(
              //   " •	عدم الحاق الضرر بالمستخدمين باي شكل كان.",
              //   style: TextStyle(fontSize: 16),
              // ),
              // SizedBox(height: 8),
              // Text(
              //   " •	في حال انخفاض تقييمك أو في حال ازدياد الشكاوى السلبية بحقك فإنه يحق للتطبيق التصرف بما يراه مناسباً.",
              //   style: TextStyle(fontSize: 16),
              // ),
              // SizedBox(height: 8),
              // Text(
              //   " •	إقرارك باتباعك لجميع القوانين واللوائح والأنظمة ذات الصلة أثناء استخدام التطبيق.",
              //   style: TextStyle(fontSize: 16),
              // ),
              // SizedBox(height: 8),
              // Text(
              //   " •	إقرارك بأحقية التطبيق في مراقبة الرسائل الخاصة عند الضرورة لخلوها من مخالفات اتفاقية الاستخدام.",
              //   style: TextStyle(fontSize: 16),
              // ),
              // SizedBox(height: 8),
              // Text(
              //   " •	إقرارك بمنح الحق للتطبيق بحفظ بياناتك ومعلوماتك ولنا حق الاطلاع عليها.",
              //   style: TextStyle(fontSize: 16),
              // ),
              // SizedBox(height: 8),
              // Text(
              //   " •	تقر موافقتك على إظهار بياناتك (الاسم- رقم الجوال) للمستخدمين الآخرين. ",
              //   style: TextStyle(fontSize: 16),
              // ),
              // SizedBox(height: 8),
              // Text(
              //   " •	تقر موافقتك بأحقية التطبيق في مشاركة المعلومات في حالة السرقة الاتلاف.",
              //   style: TextStyle(fontSize: 16),
              // ),
              // SizedBox(height: 8),
              // Text(
              //   " •	في حال مخالفتك للأنظمة في المملكة العربية السعودية او قوانين التطبيق، لنا حق الرجوع إليك بكافة الأضرار والخسائر وتحميلك أتعاب المحاماة في جميع القضايا والمسائل المتعلقة بمخالفتك وتلتزم بالتعويض عنها.",
              //   style: TextStyle(fontSize: 16),
              // ),
              // SizedBox(height: 8),
              // Text(
              //   " •	عدم عرض أي غرض غير ملائم للتصنيفات المتاحة في التطبيق وغير مسموح بتداوله في المملكة العربية السعودية.",
              //   style: TextStyle(fontSize: 16),
              // ),
              // SizedBox(height: 8),
              // Text(
              //   " •	عدم اختراق التطبيق او التحايل على سياساته.",
              //   style: TextStyle(fontSize: 16),
              // ),
              // SizedBox(height: 8),
              // Text(
              //   " •	عدم استخدام أي وسيلة غير شرعية للوصول لبيانات المستخدمين او انتهاك حقوق التطبيق.",
              //   style: TextStyle(fontSize: 16),
              // ),
              // SizedBox(height: 8),
              // Text(
              //   " •	عدم انتهاك حقوق الملكية الفكرية للتطبيق.",
              //   style: TextStyle(fontSize: 16),
              // ),
              // SizedBox(height: 8),
              // Text(
              //   " •	عدم جمع او استعمال البيانات الشخصية للمستخدمين واتصالاته لأغراض غير مصرح بها او الإفصاح عنها لاي جهة الا بموافقة من تتعلق به البيانات الشخصية او إذا اقتضت الأنظمة ذلك.",
              //   style: TextStyle(fontSize: 16),
              // ),
              // SizedBox(height: 8),
              // Text(
              //   " •	عدم الإقدام على أي ما من شأنه الحاق الضرر بسمعة التطبيق سواء في التطبيق نفسه او في مواقع التواصل الاجتماعي ويحتفظ التطبيق بحقه في الرجوع عليك بكافة الأضرار المترتبة على ذلك.",
              //   style: TextStyle(fontSize: 16),
              // ),
              // SizedBox(height: 8),
              // Text(
              //   " •	عدم انتحال صفة، أو ممثل، أو موظف، أو أي صفة توحي بانك تابع للتطبيق.",
              //   style: TextStyle(fontSize: 16),
              // ),
              // SizedBox(height: 8),
              // Text(
              //   " •	عدم ايجار او استئجار كل من:",
              //   style: TextStyle(fontSize: 16),
              // ),
              // SizedBox(height: 8),
              // Text(
              //   "   1.	السلع الممنوعة حسب قوانين المملكة العربية السعودية.",
              //   style: TextStyle(fontSize: 16, fontWeight: FontWeight.w600),
              // ),
            ],
          ),
        ),
      ),
    );
  }
}
